jantje/hardware/jantje/samd/boards.txt


arduino_zero_debug.name=Arduino Zero debug (Programming Port)
arduino_zero_debug.vid.0=0x03eb
arduino_zero_debug.pid.0=0x2157
arduino_zero_debug.upload.tool=openocd
arduino_zero_debug.upload.protocol=sam-ba
arduino_zero_debug.upload.maximum_size=262144
arduino_zero_debug.upload.use_1200bps_touch=false
arduino_zero_debug.upload.wait_for_upload_port=false
arduino_zero_debug.upload.native_usb=false
arduino_zero_debug.build.mcu=cortex-m0plus
arduino_zero_debug.build.f_cpu=48000000L
arduino_zero_debug.build.usb_product="Arduino Zero"
arduino_zero_debug.build.usb_manufacturer="Arduino LLC"
arduino_zero_debug.build.board=SAMD_ZERO
arduino_zero_debug.build.core=arduino:arduino
arduino_zero_debug.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
arduino_zero_debug.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_debug.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_debug.build.variant=arduino:arduino_zero
arduino_zero_debug.build.variant_system_lib=
arduino_zero_debug.build.vid=0x2341
arduino_zero_debug.build.pid=0x804d
arduino_zero_debug.bootloader.tool=openocd
arduino_zero_debug.bootloader.file=zero/samd21_sam_ba.bin


